Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/udir.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: They also demonstrate and develop competence when they reflect on language and text using appropriate terminology, express themselves precisely and in a nuanced way, both orally and in writing, and master morphological language rules in written Norwegian first-choice and second-choice languages.
nn: Vidare viser og utviklar dei kompetanse når dei reflekterer over språk og tekst ved bruk av fagspråk, uttrykkjer seg presist og nyansert munnleg og skriftleg og meistrar språklege formkrav på hovudmål og sidemål.

source: identify social science arguments, facts and assertions in social debates on Internet, evaluate these critically and evaluate rights and consequences of publishing something on Internet
nn: identifisere samfunnsfaglege argument, fakta og påstandar i samfunnsdebattar og diskusjonar på Internett, vurdere dei kritisk og vurdere rettar og konsekvensar når ein offentleggjer noko på Internett

source: This main subject area covers socialisation, personal finances, forms of cohabitation and criminality.
nn: Hovudområdet omfattar sosialisering, personleg økonomi, samlivsformer og kriminalitet.

source: Basic skills are integrated in the competence aims where they contribute to development of the competence in the subject, while also being part of this competence.
nn: Grunnleggjande ferdigheiter er integrerte i kompetansemåla, der dei medverkar til å utvikle fagkompetansen og er ein del av han.

source: describe the living conditions and social development of women and men regarding gender equality in Norway
nn: beskrive utviklinga i levekåra for kvinner og menn og framveksten av likestilling i Noreg

source: Half the preschools Sando visited had Internet connections.
nn: Halvparten av dei barnehagane Sando besøkte, var kopla til internett.

source: The teacher shall provide guidance on further learning and adapt the teaching to enable the pupils to use the guidance provided to develop their competence in exploring and solving problems relating to numbers and patterns and in communicating with mathematical terminology.
nn: Læraren skal gi rettleiing om vidare læring og tilpasse opplæringa slik at elevane kan bruke rettleiinga for å utvikle kompetansen sin i utforsking og problemløysing knytt til tal og mønster og kompetansen sin i kommunikasjon med matematiske omgrep.

source: that they have genuine influence and that they can have impact on matters that concern
nn: at dei blir lytta til i skolekvardagen, at dei har reell innverknad, og at dei kan påverke det som

source: Similarly, it involves understanding results in the form of graphs and tables.
nn: Like eins inneber det å forstå resultat i form av grafar og tabellar.

source: explain the terms change per unit and average speed
nn: omgrepa endring per eining og gjennomsnittsfart

source: Teaching hours are given in 60-minute units.
nn: Timetalet er oppgjeve i einingar på 60 minutt.

source: explore the options and choices a person has in conflict situations and
nn: utforske handlingsrommet og valmoglegheitene til ein person i ein

source: The physical activity culture, such as play, sports, dance and outdoor life is part of how we establish our identity in society and what we have in common.
nn: Kroppsleg aktivitet, som tidlegare høyrde kvardagslivet til, må ein no meir aktivt leggje til rette for og utvikle i allsidige rørslemiljø.

source: Food and meals are important for our physical and mental health, and also for social well-being.
nn: Mat og måltid er viktig for den fysiske og psykiske helsa til mennesket og for det sosiale velværet.

source: Ready – Steady – Start school
nn: Klar – Ferdig – Skolestart

source: investigate how the production and distribution of information can be managed and controlled by various interest groups
nn: undersøkje korleis produksjon og distribusjon av informasjon kan bli styrt og kontrollert av ulike interesser

source: give an account of key legislation and regulations related to copyright, privacy protection and freedom of expression
nn: gjere greie for sentrale lover og føresegner som gjeld opphavsrett, personvern og ytringsfridom

source: asks the Swedish researcher Helena Ackesjö, pointing at Stina’s drawing.
nn: spør den svenske forskaren Helena Ackesjö, og peikar på Stinas teikning.

source: tell others about how agriculture changed living conditions in Norway and the Nordic countries and describe main characteristics of the bronze age and iron age
nn: fortelje om korleis jordbruket forandra levemåten i Noreg og Norden og beskrive hovudtrekk ved bronsealderen og jernalderen

source: Emphasis is placed on movement, play and creative activities that are adapted to the skill levels and aptitudes of each pupil.
nn: Det skal leggjast vekt på rørsleleik, og på skapande og utøvande aktivitet tilpassa føresetnadene hos elevane.

source: They must be used actively and
nn: Dei må gjerast levande og få

source: Participating and performing dances created by the individual and those from other cultures, including youth cultures, are integrated into the subject.
nn: Deltaking i og framføring av dansar, både eigenproduserte dansar og dansar frå ulike kulturar, mellom anna frå ungdomskulturane, er ein del av det.

source: The master acts, recounts and brings the apprentice into the work process, creating a mutual space for experiences and learning.
nn: Meisteren handlar, fortel og dreg lærlingen inn i arbeidsprosessen og skaper eit felles rom for oppleving og læring.

source: Formative assessment shall help to promote learning and develop competence in the subject.
nn: Undervegsvurderinga skal bidra til å fremje læring og til å utvikle kompetanse i faget.

source: give an account of typical features of journalism, advertising, propaganda, information and entertainment
nn: gjere greie for typiske trekk ved journalistikk, reklame, propaganda, informasjon og underhaldning

source: The pupils and their homes are also
nn: Elevane og heimen har òg eit ansvar for å

source: novels, short stories, plays, poetry and factual prose in "bokmål" and "nynorsk" from 1850 to the present day and
nn: romanar, noveller, drama, lyrikk og sakprosa på bokmål og nynorsk frå 1850 til i dag og

source: The programme subject shall help promote self-awareness and cultural refinement, and in so doing it can serve as a good basis for vocational life and studies at college or university.
nn: Programfaget skal medverke til sjølvinnsikt og danning, og kan dermed vere ein god basis både for yrkesliv og studium ved høgskular og universitet.

source: The food and health subject is an important arena for cooperation and development of the pupils’ social competence.
nn: Faget mat og helse er ein viktig arena for samarbeid og utvikling av sosial kompetanse hos elevane.

source: explore, play and express themselves with movement to different rhythms and music
nn: utforske, leike og uttrykkje seg med rørsler til ulike rytmar og musikk

source: The teacher and pupils shall engage in dialogue about their development in Social Studies.
nn: Læraren skal vere i dialog med elevane om utviklinga deira i samfunnsfag.

source: To assess means to consider different aspects of an issue or point of view.
nn: Å vurdere er å vurdere ulike sider ved eit saksforhold eller synspunkt.

source: use concepts from the social sciences in academic discussions and presentations using different kinds of digital tools and build further on contributions from others
nn: bruke samfunnsfaglege omgrep i fagsamtalar og presentasjonar med ulike digitale verktøy og byggje vidare på bidrag frå andre

source: involves the use of maps, pictures, statistics and geographical information systems.
nn: omfattar bruk av kart, bilete, statistikk og geografiske informasjonssystem.

source: In addition, it’s difficult to define what a meaningful and good life is for children in a kindergarten.”
nn: Dersom dei meiner at den vaksne har behov for spesialundervisning, skal dei gi råd om kva opplæringstilbodet skal innehalde.

source: By influencing the desire to seek knowledge about society and culture, the subject will also promote the ability to discuss, reason and solve social problems.
nn: Ved å påverke lysta til å søkje kunnskap om samfunn og kulturar skal faget òg fremje evna til å diskutere, resonnere og til å løyse problem i samfunnet.

source: Developing historical overviews and insight, and training skills in everyday life and participation in society are key elements of this main subject area.
nn: Å utvikle historisk oversyn og innsikt og å øve opp ferdigheiter for kvardagsliv og deltaking i samfunnet er sentrale element i hovudområdet.

source: examine Greek and Roman communities in antiquity and find examples of how their culture has influenced our culture
nn: undersøkje greske og romerske samfunn i antikken og finne døme på korleis kulturen deira har påverka vår eigen kultur

source: History also includes how humans create pictures and shape their own understanding of the past.
nn: Historie omfattar korleis menneske skaper bilete av og formar si eiga forståing av fortida.

source: own and when they cooperate with others.
nn: når dei samarbeider med andre.

source: expressions and numbers and use the equals/does not equal signs
nn: uttrykk og tal og bruke likskaps- og ulikskapsteikn

source: Therefore, the training shall pave the way for a discussion of ethical questions, for the development of a sense for the aesthetic, and for gaining experience and creative development.
nn: I opplæringa skal det difor leggjast til rette både for diskusjon av etiske spørsmål og utvikling av estetisk sans, og for opplevingar og kreativ utfalding.

source: environment and argue for ways in which they can be sorted by properties
nn: og argumentere for måtar å sortere dei på etter eigenskapar

source: Hilde and Øystein want to ensure that the Tronvik Farm Kindergarten remains faithful to its core values.
nn: Hilde og Øystein er opptekne av at Tronvik gardsbarnehage skal vere tru mot sine kjerneverdiar.

source: The children are aware of this, since both social and academic challenges are important factors in children’s notions about school’, concludes Lindberg.
nn: Det har barna også plukka opp, for det er nettopp både sosiale forhold og faglege utfordringar som opptek barna i deira syn på skolen, fortel Lindberg.

source: measurements for area and volume in practical situations and represent them in different ways
nn: mål for areal og volum i praktiske situasjonar og representere dei på ulike måtar

source: explain ideas and ideologies that have underpinned political revolutions
nn: utforske fortida ved å formulere problemstillingar, finne, vurdere og

source: Björklund and Barendregt compiled a questionnaire that they sent to 147 ECEC teachers in southern and central Sweden.
nn: Björklund og Barendregt laga eit spørjeskjema som dei sende til 147 barnehagelærarar i Sør- og Midt-Sverige.

source: plan and present trips to neighbouring places using maps and the internet
nn: planleggje og presentere reiser til nære stader ved hjelp av kart og Internett

source: in social studies means being able to search for information, explore websites, critically assess sources, exercise netiquette and select relevant information on topics in the subject.
nn: i samfunnsfag inneber å gjere berekningar, søkje etter informasjon, utforske nettstader, utøve kjeldekritikk og nettvett og velje ut relevant informasjon om faglege tema.

source: use rhetorical concepts to analyse and evaluate texts in different non-fiction genres
nn: bruke omgrep frå retorikken for å analysere og vurdere ulike typar sakprosatekstar

source: are living in the here and now, and school must recognise the intrinsic value of childhood
nn: Samtidig lever barn og unge her og no, og skolen må anerkjenne

source: By sparking the pupils' curiosity and stimulating their sense of wonder and their creative activities, the subject will also help them understand themselves better, master their own world and motivate them to seek new insights and pursue lifelong learning.
nn: Ved å gjere elevane nyfikne og stimulere til undring og skapande arbeid vil faget kunne setje dei betre i stand til å forstå seg sjølve, meistre si eiga verd og motivere til ny innsikt og livslang læring.

source: The teacher and the pupils shall engage in dialogue on the development the pupils demonstrate in oral Norwegian and in written Norwegian first-choice and second-choice languages.
nn: Læraren og elevane skal vere i dialog om utviklinga elevane viser i norsk munnleg og i skriftleg hovudmål og sidemål.

source: describe some of the characteristics of common vernaculars in Norway and discuss attitudes towards different vernaculars
nn: gjere greie for nokre kjenneteikn på hovudgrupper av talemål i Noreg, og diskutere haldningar til ulike talemål og dei skriftlege målformene nynorsk og bokmål

source: analyse, interpret and compare a selection of key Norwegian texts and some international texts from different literary traditions from the Romantic era until the present day and place them in a cultural-historical context
nn: analysere, tolke og samanlikne eit utval av sentrale norske og nokre internasjonale tekstar frå ulike litterære tradisjonar frå romantikken til i dag, og setje dei inn i ein kulturhistorisk samanheng

source: elaborate on the EU's aims and governing bodies and discuss Norway's relationship to the EU
nn: gjere greie for EU sine mål og styringsorgan og diskutere Noreg sitt forhold til EU

source: structure texts with a heading, introduction, main section and conclusion
nn: strukturere tekstar med overskrift, innleiing, hovuddel og avslutning

source: Teaching hours are given in 60-minute units:
nn: Timetala er oppgjevne i einingar på 60 minutt:

source: It also involves using bodies of laws, reference works and statistical material and keeping abreast of legal issues in the media.
nn: Det inneber òg å nytte lovsamling, oppslagsverk og statistisk materiale og halde seg orientert om juridiske tema i media.

source: The programme subject Media and information knowledge builds on a humanistic and social science tradition.
nn: Programfaget medie- og informasjonskunnskap byggjer både på ein humanistisk og ein samfunnsvitskapleg tradisjon.

source: The Norwegian language comprises two equal forms of Norwegian bokmål and nynorsk.
nn: Norsk omfattar dei likestilte skriftspråka bokmål og nynorsk.

source: use statistical sources to calculate and describe tendencies and variations in social science debates, and evaluate whether the statistics provide credible information
nn: bruke statistiske kjelder til å berekne og beskrive tendensar og variasjonar i samfunnsfaglege drøftingar og vurdere om statistikken gjev påliteleg informasjon

source: The subject has been structured into main areas with competence aims.
nn: Faget er strukturert i hovudområde som det er formulert kompetansemål for.

source: In the social studies subject the basic skills are understood as follows:
nn: I samfunnsfag forstår ein grunnleggjande ferdigheiter slik:

source: listen to, summarise main content and extract relevant information from spoken and visualised texts
nn: lytte til, summere opp hovudinnhaldet og trekkje ut relevant informasjon i munnlege tekstar

source: explain the reasons why colonial powers conquered territories and
nn: gjere greie for årsaker til at kolonimakter la landområde under seg, og

source: Planning, setting goals, reflection and assessment related to occupational therapy also belong to the subject.
nn: Målsetjing og planlegging, kritisk refleksjon og vurdering knytt til aktiviseringsarbeid er ein del av hovudområdet.

source: Everyone must learn to cooperate, function together with others and
nn: Alle skal lære å samarbeide, fungere saman med andre og

source: explain the reasons why people have migrated and discuss cultural
nn: samanlikne ulike framstillingar av ei hending og reflektere over at

source: Problems can sometimes be difficult, and the children understand that.
nn: Av og til kan problemet vere vanskeleg, og det er barna med på.

source: give examples of situations where it might be useful to have some English-language skills
nn: Å forstå tal er nødvendig når ein skal planleggje og gjennomføre treningsarbeid.

source: give an account of key similarities and differences between Old Norse and modern Norwegian
nn: gjere greie for nokre sentrale likskapar og skilnader mellom norrønt og moderne norsk språk

source: Working and business life
nn: Arbeids- og næringsliv

source: dialogue and quality development.
nn: bruke reglane om arbeidsgjevaransvar

source: discuss and elaborate on ideas and forces that led to the American struggle for freedom and the French revolution, and the consequences these had for the development of democracy in Norway
nn: drøfte idear og krefter som førte til den amerikanske fridomskampen og den franske revolusjonen, og følgjer som dette fekk for den demokratiske utviklinga i Noreg

source: tensions between different interests and views.
nn: alltid vere spenningar mellom ulike interesser og syn.

source: create and assess budgets and accounts by using spreadsheets with
nn: lage og vurdere budsjett og rekneskap ved å bruke rekneark med

source: Conexus is responsible for the technical implementation of the survey on behalf of the Norwegian Directorate for Education and Training, and they must follow the same rules regarding personal data.
nn: Conexus driftar det tekniske i undersøkinga på vegner av Utdanningsdirektoratet, og dei må følgje same regelverk om personopplysningar.

source: In vocational education programmes and in education programmes for sports and music, dance and drama, the social studies subject has competence aims after VG2.
nn: I yrkesfaglege utdanningsprogram og i utdanningsprogram for idrettsfag og musikk, dans og drama har samfunnsfag kompetansemål etter Vg2.

source: solutions through knowledge and collaboration, and they must learn about the relationship
nn: løysingar, og dei skal lære om samanhengar mellom handlingar og konsekvensar.

source: Learning in the subject shall provide pupils with a point of departure for lifelong enjoyment of physical activity and a sense of mastery based on own skills and ability levels.
nn: Dei skal òg få øving i å gjere greie for opplevingar, vurdere praktiske aktivitetar og reflektere over verksemda og sin eigen innsats i faget.

source: School shall facilitate for and support the pupils' development in thefive basic skills throughout the entire learning path.
nn: Skolen skal leggje til rette for og støtte elevane si utvikling av dei femgrunnleggjande ferdigheitene gjennom heile opplæringsløpet.Læreplanverket definerer fem grunnleggjande ferdigheiter:

source: Aids and technology are used in most mathematical activities.
nn: I det meste av matematisk aktivitet nyttar ein hjelpemiddel og teknologi.

source: • Develop learning concepts for 0–6-year-olds: Focus on giving children a good learning environment throughout their time at school.
nn: • Utvikle læringsomgrepet for 0–6-åringar: Fokuser på å gi barna eit godt læringsmiljø gjennom heile utdanningsløpet.

source: They also invited other researchers who talked about evaluation from a professional point of view.
nn: Til desse seminara inviterte dei òg andre forskarar, som snakka om vurderingar ut frå ein fagleg ståstad.

source: Being able to read also means processing and using varied information from images, film, drawings, graphs, tables, globes and maps.
nn: Å kunne lese vil samtidig seie å behandle og bruke variert informasjon frå bilete, film, teikningar, grafar, tabellar, globus og kart.

source: various interests relating to resource and land use in Norway, in Sápmi/Sábme/Sáepmie and in the northern regions
nn: ulike interesser knytte til ressurs- og arealbruk i Noreg, Sápmi/Sábme/Sáepmie og nordområda

source: It also focuses on who and what influences young people today.
nn: Det handlar også om kven og kva som påverkar ungdom i dag.

source: We can discuss independently and in dialogue with others.
nn: Å drøfte kan vi gjere sjølvstendig og i dialog med andre.

source: describe societal changes from antiquity to early modern times and
nn: beskrive samfunnsendringar frå antikken til tidleg nytid og vurdere kva

source: calculate and elaborate on measures of central tendency and measures of spread
nn: berekne kumulativ frekvens og finne og drøfte sentralmål og spreiingsmål

source: What is it about contact with parents?
nn: Kva er det med foreldrekontakten?

source: This makes it possible to describe and analyse patterns and relationships.
nn: Det gjev høve til å beskrive og analysere mønster og samanhengar.

source: depth learning implies applying knowledge and skills in different ways so that over time the
nn: inneber å nytte kunnskapar og ferdigheiter på ulike måtar, slik at elevane over tid kan meistre

source: on whether peace treaties have helped create peace and reconciliation
nn: over om fredsslutningane bidrog til å skape fred og forsoning

source: plan and prepare safe and nutritionally sound food, and explain which nutrients the food contains
nn: planleggje og lage trygg og ernæringsmessig god mat, og forklare kva for næringsstoff matvarene inneheld

source: They also develop and demonstrate competence when they formulate subject-related research questions and find and critically use historical material in their reflection and reasoning in constructing historical narratives.
nn: Dei utviklar og viser òg kompetanse når dei formulerer faglege problemstillingar, og når dei finn og kritisk bruker historisk materiale i refleksjon og argumentasjon til å konstruere historieforteljingar.

source: In the studies, emphasis shall be placed on communication and interaction through work.
nn: Han/ho skal òg få kunnskap om koordinering av aktivitetar og samhandling i yrkesutøvinga.

source: Key elements of the subject are movement and play, versatile sports, fair play, dance and outdoor life.
nn: Opplæringa i faget skal medverke til at elevane opplever glede, inspirasjon og sjølvforståing ved å vere i rørsle og samhandle med andre.

source: The pupils also demonstrate and develop competence when they produce short and long texts in different genres for different purposes and receivers and when they revise their own texts.
nn: Elevane viser og utviklar òg kompetanse når dei produserer kortare og lengre tekstar i ulike sjangrar, for ulike formål og mottakarar, og når dei arbeider vidare med eigne tekstar.

source: use an atlas, find information from printed thematic maps and digital map services and locate neighbouring municipalities, counties in Norway, the traditional Sami areas and the largest countries in the world on a map
nn: bruke atlas, hente ut informasjon frå papirbaserte temakart og digitale karttenester og plassere nabokommunane, fylka i Noreg, dei tradisjonelle samiske områda og dei største landa i verda på kart

source: To use means to apply something or to carry out a task to reach a goal.
nn: Å utforske handlar om å oppleve og eksperimentere og kan ivareta nyfikne og undring.

source: Culture and modelling
nn: Kultur og modellering

source: experiment with physical expression and perform simple dances from different cultures
nn: følgje reglar og prinsipp for samhandling og fair play

source: collect information from globes, maps and digital sources and use this to talk about places, people and languages
nn: samle opplysningar frå globus, kart og digitale kjelder og bruke dei til å samtale om stader, folk og språk

source: 'Ethical reflections on ICT are a natural part of day-to-day routines in preschool', says researcher Svein Sando.
nn: Etiske refleksjonar om IKT er ein naturleg del av kvardagen i barnehagen, meiner forskar Svein Sando.
